## [CSV 데이터파일 다루기]

(1) 모듈 로딩<hr>

In [43]:
import pandas as pd

(2) 데이터 준비<hr>

- 파일이름 = 경로 + 파일명
- 경로 = 2가지 종류
  * 절대경로 : 드라이브부터 파일까지의 전체 경로(ex: C:\Users\data\a.txt)
  * 상대경로 : 현재 파일을 기준으로 경로 설정'
      * ./ : 현재 위치(ex: ./a.txt) <- 현재 파일과 동일한 폴더/위치에 존재
      * ../ : 한 단계 위로 의미(ex: ../data/b.csv ) <- 현재 파일이 존재하는 폴더 밖에 존재하는 파일

In [44]:
file= './test.csv' # = (file ='test.txt')

In [45]:
file2 = '../DATA/movies.csv'

(3) 데이터 저장 : CSV -> DataFrame<hr>

In [46]:
movieDF = pd.read_csv(file2)

(4) 데이터 확인<hr>

In [47]:
#전체적인 데이터 정보 확인 : info() method
movieDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 782 entries, 0 to 781
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Rank    782 non-null    int64
 1   Title   782 non-null    object
 2   Studio  782 non-null    object
 3   Gross   782 non-null    object
 4   Year    782 non-null    int64
dtypes: int64(2), object(3)
memory usage: 30.7+ KB

In [48]:
# 실제 저장된 데이터 확인: head(), tail()
movieDF.head
movieDF.tail

<bound method NDFrame.tail of      Rank                         Title           Studio       Gross  Year
0       1             Avengers: Endgame      Buena Vista  $2,796.30   2019
1       2                        Avatar              Fox  $2,789.70   2009
2       3                       Titanic        Paramount  $2,187.50   1997
3       4  Star Wars: The Force Awakens      Buena Vista  $2,068.20   2015
4       5        Avengers: Infinity War      Buena Vista  $2,048.40   2018
..    ...                           ...              ...         ...   ...
777   778                     Yogi Bear  Warner Brothers    $201.60   2010
778   779           Garfield: The Movie              Fox    $200.80   2004
779   780                   Cats & Dogs  Warner Brothers    $200.70   2001
780   781      The Hunt for Red October        Paramount    $200.50   1990
781   782                      Valkyrie              MGM    $200.30   2008

[782 rows x 5 columns]>

(5)read_csv 파일 매개변수 살펴보기<hr>

- header parameter : DataFrame의 컬럼명 설정.
    * 기본값: CSV파일의 첫 번째 줄의 데이터를 컬럼명으로 설정.
    * None 설정시 csv라인이 컬럼명이 아님 의미 =>컬럼명 미지정.
    * 번호 지정시 해당하는 행번호의 데이터가 헤더가 됨. (그 이전 행 데이터는 사라짐)

In [49]:
pd.read_csv(file2, header = None) #맨 윗줄을 column명으로 쓰지 않고 데이터로 가지고 오기.

        0                             1                2           3     4
0    Rank                         Title           Studio       Gross  Year
1       1             Avengers: Endgame      Buena Vista  $2,796.30   2019
2       2                        Avatar              Fox  $2,789.70   2009
3       3                       Titanic        Paramount  $2,187.50   1997
4       4  Star Wars: The Force Awakens      Buena Vista  $2,068.20   2015
..    ...                           ...              ...         ...   ...
778   778                     Yogi Bear  Warner Brothers    $201.60   2010
779   779           Garfield: The Movie              Fox    $200.80   2004
780   780                   Cats & Dogs  Warner Brothers    $200.70   2001
781   781      The Hunt for Red October        Paramount    $200.50   1990
782   782                      Valkyrie              MGM    $200.30   2008

[783 rows x 5 columns]

- index_col parameter: 컬럼 중 행 인덱스로 설정(set_index와 같은 역할 수행)

In [51]:
pd.read_csv(file2, index_col = ['Rank','Title'] ) #multi - index
pd.read_csv(file2, index_col = 'Rank') #single - index

                             Title           Studio       Gross  Year
Rank
1                Avengers: Endgame      Buena Vista  $2,796.30   2019
2                           Avatar              Fox  $2,789.70   2009
3                          Titanic        Paramount  $2,187.50   1997
4     Star Wars: The Force Awakens      Buena Vista  $2,068.20   2015
5           Avengers: Infinity War      Buena Vista  $2,048.40   2018
...                            ...              ...         ...   ...
778                      Yogi Bear  Warner Brothers    $201.60   2010
779            Garfield: The Movie              Fox    $200.80   2004
780                    Cats & Dogs  Warner Brothers    $200.70   2001
781       The Hunt for Red October        Paramount    $200.50   1990
782                       Valkyrie              MGM    $200.30   2008

[782 rows x 4 columns]

- sep / delimiter : CSV파일에서 데이터구분자 설정
  * 기본값 : ','

In [52]:
pd.read_csv(file, header = None, sep = ';')

    0   1   2   3
0  10  20  30  40
1   1   2   3   4
2  11  22  33  44

- skiprows parameter: csv파일에서 읽어들이지 않을 행 갯수 지정(앞부분)

In [58]:
pd.read_csv(file, sep = ';', skiprows = 2, header = None)

    0   1   2   3
0  10  20  30  40
1   1   2   3   4
2  11  22  33  44

- skipfooter = 맨 밑에 줄을 등호 뒤에 오는 숫자만큼 출력 안 해주기(뒷부분)

In [61]:
pd.read_csv(file, sep = ';', skiprows = 2, header = None, skipfooter = 1, engine = 'python') #판다스 엔진에서는 스킵푸터를 지원하지 않으므로 다른 엔진으로 지정해줘야

    0   1   2   3
0  10  20  30  40
1   1   2   3   4

 - usecols : 컬럼에서 특정 컬럼만 선택하여 로딩하기
   * usecols = [0, 2, ...]
   * usecols = [columnName1,columnName2, ...]

In [65]:
pd.read_csv(file, sep = ';' ,skiprows = 3, header = None, usecols = [0,2])

    0   2
0  10  30
1   1   3
2  11  33